export const adminTodo = [
  '登录,个人信息,修改密码,管理后台管理系统所有数据',
  '管理后台管理系统所有数据',
  '科室信息管理：管理平台的科室信息',
  '医生排班管理：可以给平台所有医生进行排班，按找星期几统一排班',
  '预约挂号管理：可以查看所有当天可预约挂号的医生信息',
  '患者挂号管理：管理所有患者挂号的信息',
  '患者就诊管理：管理所有患者就诊的信息',
  '住院登记管理：管理所有所需住院的患者的住院登记信息',
  '系统公告管理：管理系统公告信息',
  '管理员信息：管理系统管理员的相关信息',
  '医生信息：管理系统管理员的相关信息',
  '患者信息：管理系统患者的信息',
];

export const doctorTodo = [
  '注册、登录、个人信息、修改密码、查看系统公告',
  '查看排班信息：可以查看自己的排班信息',
  '患者挂号信息：可以查看挂自己号的患者挂号信息',
  '患者叫号：可以对当天挂自己号的患者进行叫号操作',
  '患者就诊：叫号后可以对患者进行就诊，可以填写医嘱病历',
];

export const patientTodo = [
  '注册、登录、个人信息、修改密码、查看系统公告',
  '查看当天医生：可以查看当天在号的医生',
  '取消挂号：在医生叫号之前，可以对挂号信息进行取消',
  '我的挂号：可以查看自己所有的挂号记录',
  '我的就诊：可以查看自己的所有就诊记录，查看医嘱病历',
  '住院登记：可以查看自己的住院信息',
  '充值功能：个人中心可以进行充值操作',
];
